// Мінімум

// Напиши всі можливі варіанти створення функцій.

// Створення функції:
//  - декларація;
//  - запис у змінну;
//  - стрілочна;
//  - метод як спеціальний випадок? функцій


// Створи функцію, яка буде виводити кількість переданих їй аргументів.

function countArgs(...theArgs) {
  let total = 0;
  for (let i = 0; i < theArgs.length; i++) {
    total += 1;
  }
  alert(total)
}

countArgs(1, 2, 3, 4, 5, 56, 6767, 66690)



























// Напиши функцію, яка приймає 2 числа і повертає :
// -1, якщо перше число менше, ніж друге; 
// 1 - якщо перше число більше, ніж друге; 
// 0 - якщо числа рівні.
// Напиши функцію, яка обчислює факторіал переданого їй числа.
// Напиши функцію, яка приймає три окремі цифри і перетворює їх в одне число. Наприклад: цифри 1, 4, 9 перетворяться в число 149.
// Напиши функцію, яка приймає довжину і ширину прямокутника і обчислює його площу. Якщо в функцію передали 1 параметр, то вона обчислює площу квадрата.
// Норма

// Напиши функцію, яка перевіряє, чи є передане їй число “досконалим числом”. Досконале число - це число, яке дорівнює сумі всіх своїх дільників.
// Напиши функцію, яка приймає мінімальне і максимальне значення для діапазону, і виводить тільки ті числа з діапазону, які є досконалими. Використовуй написану раніше функцію, щоб дізнатися, чи є це число досконалим.